package com.sabu.bongobondhu;

import android.support.v7.app.AppCompatActivity;
import android.os.Bundle;
import android.widget.ArrayAdapter;
import android.widget.ListView;

import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.AdView;
import com.google.android.gms.ads.MobileAds;

public class BcommentsActivity extends AppCompatActivity {

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_bcomments);
        MobileAds.initialize(getApplicationContext(), "ca-app-pub-7243601331616499~1041653365");
        AdView mAdView = (AdView) findViewById(R.id.adView);
        AdRequest adRequest = new AdRequest.Builder().build();
        mAdView.loadAd(adRequest);
        populateView();
    }

    private void populateView() {
            String[] item = new String[]{"১. আমরা যখন মরতে শিখেছি, তখন কেউ আমাদের দাবায়ে রাখতে পারবে না।",

        "২. এবারের সংগ্রাম আমাদের মুক্তির সংগ্রাম, এবারের সংগ্রাম স্বাধীনতার সংগ্রাম!",

        "৩. মানুষকে ভালোবাসলে মানুষও ভালোবাসে। যদি সামান্য ত্যাগ স্বীকার করেন, তবে জনসাধারণ আপনার জন্য জীবন দিতেও পারে।",

        "৪. আমার সবচেয়ে বড় শক্তি আমার দেশের মানুষকে ভালবাসি, সবচেয়ে বড় দূর্বলতা আমি তাদেরকে খুব বেশী ভালবাসি।",

        "৫. প্রধানমন্ত্রী হবার কোন ইচ্ছা আমার নেই। প্রধানমন্ত্রী আসে এবং যায়। কিন্তু, যে ভালোবাসা ও সম্মান দেশবাসী আমাকে দিয়েছেন, তা আমি সারাজীবন মনে রাখবো।",

        "৬. সাত কোটি বাঙ্গালির ভালোবাসার কাঙ্গাল আমি। আমি সব হারাতে পারি, কিন্তু বাংলাদেশের মানুষের ভালোবাসা হারাতে পারব না।",

        "৭. বিশ্ব দুই শিবিরে বিভক্ত - শোষক আর শোষিত। আমি শোষিতের পক্ষে।",

        "৮. এই স্বাধীন দেশে মানুষ যখন পেট ভরে খেতে পাবে, পাবে মর্যাদাপূর্ণ জীবন; তখনই শুধু এই লাখো শহীদের আত্মা তৃপ্তি পাবে।",

        "০৯. দেশ থেকে সর্বপ্রকার অন্যায়, অবিচার ও শোষণ উচ্ছেদ করার জন্য দরকার হলে আমি আমার জীবন উৎসর্গ করব।",

        "১০. আমি যদি বাংলার মানুষের মুখে হাসি ফোটাতে না পারি, আমি যদি দেখি বাংলার মানুষ দুঃখী, আর যদি দেখি বাংলার মানুষ পেট ভরে খায় নাই, তাহলে আমি শান্তিতে মরতে পারব না।",

        "১১. এ স্বাধীনতা আমার ব্যর্থ হয়ে যাবে যদি আমার বাংলার মানুষ পেট ভরে ভাত না খায়। এই স্বাধীনতা আমার পূর্ণ হবে না যদি বাংলার মা-বোনেরা কাপড় না পায়। এ স্বাধীনতা আমার পূর্ণ হবে না যদি এদেশের মানুষ যারা আমার যুবক শ্রেণী আছে তারা চাকরি না পায় বা কাজ না পায়।",

        "১২. আমাদের চাষীরা হল সবচেয়ে দুঃখী ও নির্যাতিত শ্রেণী এবং তাদের অবস্থার উন্নতির জন্যে আমাদের উদ্যোগের বিরাট অংশ অবশ্যই তাদের পেছনে নিয়োজিত করতে হবে।",

        "১৩. যিনি যেখানে রয়েছেন, তিনি সেখানে আপন কর্তব্য পালন করলে দেশের মধ্যে বিশৃঙ্খলা সৃষ্টি হতে পারে না।",

        "১৪. সরকারী কর্মচারীদের জনগণের সাথে মিশে যেতে হবে। তারা জনগণের খাদেম, সেবক, ভাই। তারা জনগণের বাপ, জনগণের ছেলে, জনগণের সন্তান। তাদের এই মনোভাব নিয়ে কাজ করতে হবে।",

        "১৫. সমস্ত সরকারী কর্মচারীকেই আমি অনুরোধ করি, যাদের অর্থে আমাদের সংসার চলে তাদের সেবা করুন।",

        "১৬. গরীবের উপর অত্যাচার করলে আল্লাহর কাছে তার জবাব দিতে হবে।",

        "১৭. জীবন অত্যন্ত ক্ষণস্থায়ী। এই কথা মনে রাখতে হবে। আমি বা আপনারা সবাই মৃত্যুর পর সামান্য কয়েক গজ কাপড় ছাড়া সাথে আর কিছুই নিয়ে যাব না। তবে কেন আপনারা মানুষকে শোষণ করবেন, মানুষের উপর অত্যাচার করবেন?",

        "১৮. দেশের সাধারণ মানুষ, যারা আজও দুঃখী, যারা আজও নিরন্তর সংগ্রাম করে বেঁচে আছে, তাদের হাসি-কান্না, সুখ-দুঃখকে শিল্প-সাহিত্য-সংস্কৃতির উপজীব্য করার জন্য শিল্পী, সাহিত্যিক ও সংস্কৃতিসেবীদের প্রতি আহবান জানাচ্ছি।",

        "১৯. সাংস্কৃতিক স্বাধীনতা ছাড়া রাজনৈতিক ও অর্থনৈতিক স্বাধীনতা অর্থহীন। তাই মাটি ও মানুষকে কেন্দ্র করে গণমানুষের সুখ, শান্তি ও স্বপ্ন এবং আশা-আকাঙ্খাকে অবলম্বন করে গড়ে উঠবে বাংলার নিজস্ব সাহিত্য-সংস্কৃতি।",

        "২০. বাঙ্গালি জাতীয়তাবাদ না থাকলে আমাদের স্বাধীনতার অস্তিত্ব বিপন্ন হবে।",

        "২১. গণআন্দোলন ছাড়া, গণবিপ্লব ছাড়া বিপ্লব হয় না।",

        "২২. জনগণকে ছাড়া, জনগণকে সংঘবদ্ধ না করে, জনগণকে আন্দোলনমুখী না করে এবং পরিস্কার আদর্শ সামনে না রেখে কোন রকম গণআন্দোলন হতে পারে না।",

        "২৩. আন্দোলন মুখ দিয়ে বললেই করা যায় না। আন্দোলনের জন্য জনমত সৃষ্টি করতে হয়। আন্দোলনের জন্য আদর্শ থাকতে হয়। আন্দোলনের জন্য নিঃস্বার্থ কর্মী হতে হয়। ত্যাগী মানুষ থাকা দরকার। আর সর্বোপরি জনগণের সংঘবদ্ধ ও ঐক্যবদ্ধ সমর্থন থাকা দরকার।",

        "২৪. অযোগ্য নেতৃত্ব, নীতিহীন নেতা ও কাপুরুষ রাজনীতিবিদদের সাথে কোন দিন একসাথে হয়ে দেশের কাজে নামতে নেই। তাতে দেশসেবার চেয়ে দেশের ও জনগণের সর্বনাশই বেশি হয়।",

        "২৫. রাজনৈতিক প্রতিষ্ঠানের চারটি জিনিসের প্রয়োজন, তা হচ্ছে: নেতৃত্ব, ম্যানিফেস্টো বা আদর্শ, নিঃস্বার্থ কর্মী এবং সংগঠন।",

        "২৬. ভিক্ষুক জাতির ইজ্জত থাকে না। বিদেশ থেকে ভিক্ষা করে এনে দেশকে গড়া যাবে না। দেশের মধ্যেই পয়সা করতে হবে।",

        "২৭. বাংলার উর্বর মাটিতে যেমন সোনা ফলে, ঠিক তেমনি পরগাছাও জন্মায়! একইভাবে,বাংলাদেশে কতকগুলো রাজনৈতিক পরগাছা রয়েছে, যারা বাংলার মানুষের বর্তমান দুঃখ-দূর্দশার জন্য দায়ী।",

        "২৮. যদি আমরা বিভক্ত হয়ে যাই এবং স্বার্থের দ্বন্দ ও মতাদর্শের অনৈক্যের দ্বারা প্রভাবান্বিত হয়ে আত্বঘাতী সংঘাতে মেতে উঠি, তাহলে যারা এদেশের মানুষের ভালো চান না ও এখানাকার সম্পদের ওপর ভাগ বসাতে চান তাদেরই সুবিধা হবে এবং বাংলাদেশের নির্যাতিত, নিপীড়িত, ভাগ্যাহত ও দুঃখী মানুষের মুক্তির দিনটি পিছিয়ে যাবে।",

        "২৯. আর সাম্প্রদায়িকতা যেন মাথাচারা দিয়ে উঠতে না পারে। ধর্ম নিরপেক্ষ রাষ্ট্র বাংলাদেশ। মুসলমান তার ধর্মকর্ম করবে। হিন্দু তার ধর্মকর্ম করবে। বৌদ্ধ তার ধর্মকর্ম করবে। কেউ কাউকে বাধা দিতে পারবে না।",

        "৩০. পবিত্র ধর্মকে রাজনৈতিক হাতিয়ার হিসেবে ব্যবহার করা চলবে না।",

        "৩১. ভুলে যেয়ো না। স্বাধীনতা পেয়েছো এক রকম শত্রুর সাথে লড়াই করে। তখন আমরা জানতাম আমাদের এক নম্বর শত্রু পাকিস্থানের সামরিক বাহিনী ও শোষকগোষ্ঠী। কিন্তু, এখন শত্রুকে চেনাই কষ্টকর।",

        "৩২. শহীদদের রক্ত যেন বৃথা না যায়।",

        "৩৩. বাংলাদেশ এসেছে বাংলাদেশ থাকবে।",

        "৩৪. বাংলার মাটি দু্র্জয় ঘাঁটি জেনে নিক দুর্বৃত্তেরা।",

        "৩৫. বাংলার মাটিতে যুদ্ধাপরাধীর বিচার হবেই।"};
            ArrayAdapter<String> adapter = new ArrayAdapter<String>(this,android.R.layout.simple_list_item_1,item);
            ListView listView = (ListView) findViewById(R.id.bcmnts_list);
            listView.setAdapter(adapter);
    }
}
